/*** Рекомендации ***
 *  Слабая связность. Чистые функции. Самодокументирование
 *  Import для вставки кода. Import from / export для вызова функции
 *  Объединять манипуляции с DOM. documentFragment
 *  Кэшировать. Вычисляемые стили вызывают перерасчет
 *  requestAnimationFrame для перерисовок. Ответ на действие < 10ms (~16.6ms)
 *  css-классы для изменения внешнего вида
 *  new FormData(document.forms.person) serialize данных из формы по name
 *  console.time/End для тестирования производительности
 */

