/*** Рекомендации ***
 *  Слабая связность. Чистые функции. Вложенность <= 2. Комментирование
 *  Сначало код, функции по мере использования в коде - ниже
 *  Import для вставки кода. Import from / export для вызова функции
 *  Объединять манипуляции с DOM. documentFragment
 *  Кэшировать. Вычисляемые стили вызывают перерасчет. Не переопределять типы
 *  requestAnimationFrame для перерисовок. Ответ на действие < ~16.6ms
 *  css-классы для изменения внешнего вида
 *  new FormData(document.forms.person) serialize данных из формы по name
 *  console.time/End для тестирования производительности
 */

