/**
 * Рекомендации по написанию кода:
 *  Слабая связанность. модульность
 *  Единственный возврат значения из функции
 *  Линейность (простота). Комментирование сложных и не явных мест
 *  Объединять манипуляции с DOM (documentFragment). Кэшировать вычисляемые стили
 *  Кэшировать промежуточные результаты расчетов
 *  requestAnimationFrame. Ответ на действие пользователя < 10ms (16ms)
 *  css-классы для изменения внешнего вида элемента или в свойстве cssText
 *  Чистые функции. Не более 2 передаваемых параметров. Не передавать объект
 *  for in или Object.keys
 *  console.time/End для тестирования производительности
 */
