/**
 * Рекомендации по написанию кода:
 *  Слабая связанность. модульность
 *  Явный (единственный) возврат значения из функции
 *  Линейность (простота). Комментирование сложных и не явных мест
 *  Объединять манипуляции с DOM (documentFragment). Кэшировать вычисляемые стили
 *  requestAnimationFrame. < 10ms (16ms) ответ на действие пользователя
 *  css-классы для переключения внешнего вида элемента или в свойстве cssText
 *  2 чеин функции переносить на новую строку
 *  Чистые функции. Не более 2 передаваемых параметров
 */
